grpc-vs-json-benchmark/outputs/json_test.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: json_test.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 40s max duration (incl. graceful stop):
              * default: 50 looping VUs for 10s (gracefulStop: 30s)


running (01.0s), 50/50 VUs, 2819 complete and 0 interrupted iterations
default   [  10% ] 50 VUs  01.0s/10s

running (02.0s), 50/50 VUs, 5585 complete and 0 interrupted iterations
default   [  20% ] 50 VUs  02.0s/10s

running (03.0s), 50/50 VUs, 8807 complete and 0 interrupted iterations
default   [  30% ] 50 VUs  03.0s/10s

running (04.0s), 50/50 VUs, 11931 complete and 0 interrupted iterations
default   [  40% ] 50 VUs  04.0s/10s

running (05.0s), 50/50 VUs, 15250 complete and 0 interrupted iterations
default   [  50% ] 50 VUs  05.0s/10s

running (06.0s), 50/50 VUs, 18108 complete and 0 interrupted iterations
default   [  60% ] 50 VUs  06.0s/10s

running (07.0s), 50/50 VUs, 20820 complete and 0 interrupted iterations
default   [  70% ] 50 VUs  07.0s/10s

running (08.0s), 50/50 VUs, 23979 complete and 0 interrupted iterations
default   [  80% ] 50 VUs  08.0s/10s

running (09.0s), 50/50 VUs, 27358 complete and 0 interrupted iterations
default   [  90% ] 50 VUs  09.0s/10s

running (10.0s), 50/50 VUs, 30388 complete and 0 interrupted iterations
default   [ 100% ] 50 VUs  10.0s/10s


  █ TOTAL RESULTS 

    HTTP
    http_req_duration..............: avg=16.31ms min=917.05µs med=15.64ms max=185.03ms p(90)=21.3ms  p(95)=25.49ms
      { expected_response:true }...: avg=16.31ms min=917.05µs med=15.64ms max=185.03ms p(90)=21.3ms  p(95)=25.49ms
    http_req_failed................: 0.00%  0 out of 30460
    http_reqs......................: 30460  3043.653211/s

    EXECUTION
    iteration_duration.............: avg=16.39ms min=975.19µs med=15.71ms max=185.28ms p(90)=21.44ms p(95)=25.67ms
    iterations.....................: 30460  3043.653211/s
    vus............................: 50     min=50         max=50
    vus_max........................: 50     min=50         max=50

    NETWORK
    data_received..................: 4.2 MB 423 kB/s
    data_sent......................: 44 MB  4.4 MB/s



running (10.0s), 00/50 VUs, 30460 complete and 0 interrupted iterations
default ✓ [ 100% ] 50 VUs  10s